#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ProsperCI/CloudPlayground/runs/run-w3aJLX6HLvxDRyAq

Waiting for the plan to start...

Terraform v0.14.9
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.identity-pool-assume-role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "identity-pool-assume-role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_cognito_identity_pool.main will be created
  + resource "aws_cognito_identity_pool" "main" {
      + allow_unauthenticated_identities = true
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "playground"

      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = false
        }
    }

  # aws_cognito_identity_pool_roles_attachment.cognito-roles will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "cognito-roles" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + roles            = (known after apply)
    }

  # aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "playground"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Name" = "playground-user-pool"
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)
        }

      + password_policy {
          + minimum_length    = 6
          + require_lowercase = false
          + require_numbers   = false
          + require_symbols   = false
          + require_uppercase = false
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "email"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "7"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = true
          + mutable                  = false
          + name                     = "id"
          + required                 = false

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }

      + sms_configuration {
          + external_id    = "snsExternal"
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # aws_cognito_user_pool_client.web-client will be created
  + resource "aws_cognito_user_pool_client" "web-client" {
      + client_secret                 = (sensitive value)
      + id                            = (known after apply)
      + name                          = "playground-web-client"
      + prevent_user_existence_errors = (known after apply)
      + refresh_token_validity        = 30
      + supported_identity_providers  = [
          + "COGNITO",
        ]
      + user_pool_id                  = (known after apply)
    }

  # aws_cognito_user_pool_domain.main will be created
  + resource "aws_cognito_user_pool_domain" "main" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "playground"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

  # aws_iam_policy.sns will be created
  + resource "aws_iam_policy" "sns" {
      + arn         = (known after apply)
      + description = "allow send sns"
      + id          = (known after apply)
      + name        = "playground-sns"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy_attachment.allow-sns will be created
  + resource "aws_iam_policy_attachment" "allow-sns" {
      + id         = (known after apply)
      + name       = "playground-sns-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "playground-sns",
        ]
    }

  # aws_iam_role.cognito-anonymous will be created
  + resource "aws_iam_role" "cognito-anonymous" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "playground-anonymous-cognito"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.cognito-identified will be created
  + resource "aws_iam_role" "cognito-identified" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "playground-identified-cognito"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.sns will be created
  + resource "aws_iam_role" "sns" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + sts:ExternalId = "snsExternal"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cognito-idp.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "playground-sns"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.allow-cognito-anonymous will be created
  + resource "aws_iam_role_policy" "allow-cognito-anonymous" {
      + id     = (known after apply)
      + name   = "playground-cognito-anonymous"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "mobileanalytics:PutEvents",
                          + "cognito-sync:*",
                          + "cognito-identity:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.allow-cognito-identified will be created
  + resource "aws_iam_role_policy" "allow-cognito-identified" {
      + id     = (known after apply)
      + name   = "playground-cognito-identified"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "mobileanalytics:PutEvents",
                          + "cognito-sync:*",
                          + "cognito-identity:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_s3_bucket.app will be created
  + resource "aws_s3_bucket" "app" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "terraform-cloud-playground"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @cloudle, Action: `pull_request`*